Ewalk02/fishduino/apps/chihiros_heater_c6/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c6"

# Enable BLE only (NimBLE) for central client use.
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y
CONFIG_BT_NIMBLE_ROLE_CENTRAL=y
CONFIG_BT_NIMBLE_SM_LEGACY=y
CONFIG_BT_NIMBLE_SM_SC=y

# Console over UART for debug interface.
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_ESP_CONSOLE_UART_NUM=0
CONFIG_ESP_CONSOLE_UART_BAUDRATE=115200

# Logging: keep useful BLE logs.
CONFIG_LOG_DEFAULT_LEVEL_INFO=y

